using System;

namespace variablesanddatatypes
{
    class Program
    {
        static void Main()
        {
            int number = -10;    //логика работы с переменными такая же, как в С++
            Console.WriteLine(number);
            //все типы переменных и вся работа с ними такая же, как и в С++, единственное, это:
            //вместо слово auto, которое в С++, в С# используется слово var, которое автоматически присваивает тип переменной в зависимости от ее назначения 
        }
    }
}
